# 1.1 Movies Database

Take the movies dataset and turn it into a single `sqlite` database. It should have one table for each csv file in the movies dataset

In [82]:
import sqlite3 
import pandas as pd

In [185]:
df = pd.read_csv("/Users/kalebmckenzie/Documents/GitHub/4-1-sql/movies_metadata.csv")
df

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,...,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
0,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",...,1995-10-30,373554033.0,81.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Toy Story,False,7.7,5415.0
1,False,NaN,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",NaN,8844,tt0113497,en,Jumanji,When siblings Judy and Peter discover an encha...,...,1995-12-15,262797249.0,104.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Roll the dice and unleash the excitement!,Jumanji,False,6.9,2413.0
2,False,"{'id': 119050, 'name': 'Grumpy Old Men Collect...",0,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",NaN,15602,tt0113228,en,Grumpier Old Men,A family wedding reignites the ancient feud be...,...,1995-12-22,0.0,101.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Still Yelling. Still Fighting. Still Ready for...,Grumpier Old Men,False,6.5,92.0
3,False,NaN,16000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",NaN,31357,tt0114885,en,Waiting to Exhale,"Cheated on, mistreated and stepped on, the wom...",...,1995-12-22,81452156.0,127.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Friends are the people who let you be yourself...,Waiting to Exhale,False,6.1,34.0
4,False,"{'id': 96871, 'name': 'Father of the Bride Col...",0,"[{'id': 35, 'name': 'Comedy'}]",NaN,11862,tt0113041,en,Father of the Bride Part II,Just when George Banks has recovered from his ...,...,1995-02-10,76578911.0,106.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Just When His World Is Back To Normal... He's ...,Father of the Bride Part II,False,5.7,173.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45461,False,NaN,0,"[{'id': 18, 'name': 'Drama'}, {'id': 10751, 'n...",http://www.imdb.com/title/tt6209470/,439050,tt6209470,fa,رگ خواب,Rising and falling between a man and woman.,...,NaN,0.0,90.0,"[{'iso_639_1': 'fa', 'name': 'فارسی'}]",Released,Rising and falling between a man and woman,Subdue,False,4.0,1.0
45462,False,NaN,0,"[{'id': 18, 'name': 'Drama'}]",NaN,111109,tt2028550,tl,Siglo ng Pagluluwal,An artist struggles to finish his work while a...,...,2011-11-17,0.0,360.0,"[{'iso_639_1': 'tl', 'name': ''}]",Released,NaN,Century of Birthing,False,9.0,3.0
45463,False,NaN,0,"[{'id': 28, 'name': 'Action'}, {'id': 18, 'nam...",NaN,67758,tt0303758,en,Betrayal,"When one of her hits goes wrong, a professiona...",...,2003-08-01,0.0,90.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,A deadly game of wits.,Betrayal,False,3.8,6.0
45464,False,NaN,0,[],NaN,227506,tt0008536,en,Satana likuyushchiy,"In a small town live two brothers, one a minis...",...,1917-10-21,0.0,87.0,[],Released,NaN,Satan Triumphant,False,0.0,0.0
45465,False,NaN,0,[],NaN,461257,tt6980792,en,Queerama,50 years after decriminalisation of homosexual...,...,2017-06-09,0.0,75.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Queerama,False,0.0,0.0

In [156]:
#cleaing up the budget col so its easier to work with
ran_bud = df[df['budget'] == '/ff9qCepilowshEtG2GYWwzt2bs4.jpg'].index
ran_bud2 = df[df['budget'] == '/zV8bHuSL6WXoD6FWogP9j4x80bL.jpg'].index
ran_bud3 = df[df['budget'] == '/zaSf5OG7V8X8gqFvly88zDdRm46.jpg'].index

df.drop(ran_bud, inplace = True)
df.drop(ran_bud2, inplace = True)
df.drop(ran_bud3, inplace = True)

df['budget'] = df['budget'].astype(int)

In [157]:
df.to_csv('new_movies.csv')

In [83]:
conn = sqlite3.connect('movie.db')
c = conn.cursor()

In [107]:
credits = pd.read_csv('/Users/kalebmckenzie/Documents/GitHub/4-1-sql/credits.csv')
credits.to_sql('credits', conn, if_exists='replace', index = False)

In [108]:
keywords = pd.read_csv('/Users/kalebmckenzie/Documents/GitHub/4-1-sql/keywords.csv')
keywords.to_sql('keywords', conn, if_exists='replace', index = False)

In [109]:
link_s = pd.read_csv('/Users/kalebmckenzie/Documents/GitHub/4-1-sql/links_small.csv')
link_s.to_sql('link_s', conn, if_exists='replace', index = False)

In [110]:
links = pd.read_csv('/Users/kalebmckenzie/Documents/GitHub/4-1-sql/links.csv')
links.to_sql('links', conn, if_exists='replace', index = False)

In [158]:
metadata = pd.read_csv('/Users/kalebmckenzie/Documents/GitHub/4-1-sql/new_movies.csv')
metadata.to_sql('metadata', conn, if_exists='replace', index = False)

In [112]:
rating_s = pd.read_csv('/Users/kalebmckenzie/Documents/GitHub/4-1-sql/ratings_small.csv')
rating_s.to_sql('rating_s', conn, if_exists='replace', index = False)

In [113]:
ratings = pd.read_csv('/Users/kalebmckenzie/Documents/GitHub/4-1-sql/ratings.csv')
ratings.to_sql('ratings', conn, if_exists='replace', index = False)

In [117]:
def tables_in_sqlite_db(conn):
    cursor = conn.execute("SELECT name FROM sqlite_master WHERE type='table';")
    tables = [
        v[0] for v in cursor.fetchall()
        if v[0] != "sqlite_sequence"
    ]
    cursor.close()
    return tables

In [118]:
movie_tables = tables_in_sqlite_db(conn)
movie_tables

['credits', 'keywords', 'link_s', 'links', 'rating_s', 'ratings', 'metadata']

In [198]:
p2 = pd.read_sql('select * from metadata', conn)
p2

,Unnamed: 0,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,...,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
0,0,0,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,...,1995-10-30,373554033.0,81.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,None,Toy Story,0.0,7.7,5415.0
1,1,0,None,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",None,8844,tt0113497,en,Jumanji,...,1995-12-15,262797249.0,104.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Roll the dice and unleash the excitement!,Jumanji,0.0,6.9,2413.0
2,2,0,"{'id': 119050, 'name': 'Grumpy Old Men Collect...",0,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",None,15602,tt0113228,en,Grumpier Old Men,...,1995-12-22,0.0,101.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Still Yelling. Still Fighting. Still Ready for...,Grumpier Old Men,0.0,6.5,92.0
3,3,0,None,16000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",None,31357,tt0114885,en,Waiting to Exhale,...,1995-12-22,81452156.0,127.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Friends are the people who let you be yourself...,Waiting to Exhale,0.0,6.1,34.0
4,4,0,"{'id': 96871, 'name': 'Father of the Bride Col...",0,"[{'id': 35, 'name': 'Comedy'}]",None,11862,tt0113041,en,Father of the Bride Part II,...,1995-02-10,76578911.0,106.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Just When His World Is Back To Normal... He's ...,Father of the Bride Part II,0.0,5.7,173.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45458,45461,0,None,0,"[{'id': 18, 'name': 'Drama'}, {'id': 10751, 'n...",http://www.imdb.com/title/tt6209470/,439050,tt6209470,fa,رگ خواب,...,None,0.0,90.0,"[{'iso_639_1': 'fa', 'name': 'فارسی'}]",Released,Rising and falling between a man and woman,Subdue,0.0,4.0,1.0
45459,45462,0,None,0,"[{'id': 18, 'name': 'Drama'}]",None,111109,tt2028550,tl,Siglo ng Pagluluwal,...,2011-11-17,0.0,360.0,"[{'iso_639_1': 'tl', 'name': ''}]",Released,None,Century of Birthing,0.0,9.0,3.0
45460,45463,0,None,0,"[{'id': 28, 'name': 'Action'}, {'id': 18, 'nam...",None,67758,tt0303758,en,Betrayal,...,2003-08-01,0.0,90.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,A deadly game of wits.,Betrayal,0.0,3.8,6.0
45461,45464,0,None,0,[],None,227506,tt0008536,en,Satana likuyushchiy,...,1917-10-21,0.0,87.0,[],Released,None,Satan Triumphant,0.0,0.0,0.0
45462,45465,0,None,0,[],None,461257,tt6980792,en,Queerama,...,2017-06-09,0.0,75.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,None,Queerama,0.0,0.0,0.0

# 1.2 Queries

**1.2.1** Use a single query to pull the original title of movies with a budget above $5m

**1.2.2** Use a query to pull the english-language films with the word `war` in their title

**1.2.3** Left join the average ratings from the `ratings` table onto the `movies_metadata` table, so you can have a relation between budget and rating. Hint: use a subquery.

# 1.2.1

In [161]:
q1 = pd.read_sql_query(
"""
SELECT 
    original_title,
    budget

FROM metadata

WHERE budget > 5000000

""", 
    con=conn
)
q1

                    original_title    budget
0                        Toy Story  30000000
1                          Jumanji  65000000
2                Waiting to Exhale  16000000
3                             Heat  60000000
4                          Sabrina  58000000
...                            ...       ...
5166                       Detroit  34000000
5167                        சிவாஜி  12000000
5168                       Pattaya   5402000
5169  Les Visiteurs: La Révolution  25868826
5170     House of the Long Shadows   7500000

[5171 rows x 2 columns]

# 1.2.2

In [180]:
q2 = pd.read_sql_query(
"""
SELECT 
    original_language,
    title

FROM metadata

WHERE original_language = 'en'
    and title LIKE '% war %'
""", 
    con=conn
)
q2

   original_language                                              title
0                 en                                       The War Room
1                 en                                    The War at Home
2                 en                              The War of the Worlds
3                 en                                       The War Zone
4                 en                               The War of the Roses
5                 en                               At War with the Army
6                 en                             I Was a Male War Bride
7                 en                                      The War Wagon
8                 en       Outfoxed: Rupert Murdoch's War on Journalism
9                 en                                     The War Within
10                en                  Iraq for Sale: The War Profiteers
11                en                                      The War Tapes
12                en                               The War on Democracy
13                en                                       The War Lord
14                en                                 Punisher: War Zone
15                en                         Dallas - War of The Ewings
16                en                      H.G. Wells' War of the Worlds
17                en                 Why We Fight: War Comes to America
18                en                                       The War Game
19                en                        The Art of War II: Betrayal
20                en                    The Private War of Major Benson
21                en                       Tomorrow, When the War Began
22                en  Jean Renoir: Part One - From La Belle Époque t...
23                en                              The War You Don't See
24                en                                        World War Z
25                en                    World War II: When Lions Roared
26                en                      The War Between Men and Women
27                en                    The Art of War III: Retribution
28                en  Breaking the Silence: Truth and Lies in the Wa...
29                en      Unborn in the USA: Inside the War on Abortion
30                en                                       The War Boys
31                en                                    The War at Home
32                en           Suppose They Gave a War and Nobody Came?
33                en                                Flight World War II
34                en                        Iliza Shlesinger: War Paint
35                en                  Merlin and the War of the Dragons
36                en                Arthur 3: The War of the Two Worlds
37                en                         The Return of the War Room
38                en    Obsession: Radical Islam's War Against the West
39                en                        The War Against Mrs. Hadley
40                en           The Oil Factor: Behind the War on Terror
41                en                  The Great Martian War 1913 - 1917
42                en                            The Coming War on China

# 1.2.3

In [199]:
q3 = pd.read_sql_query(
"""
SELECT
    budget,
    rating_s.rating

FROM metadata

LEFT JOIN rating_s ON
    metadata.id = rating_s.movieId

ORDER BY rating_s.rating DESC
    
""", con=conn)

q3

         budget  rating
0      60000000     5.0
1      60000000     5.0
2      98000000     5.0
3      98000000     5.0
4      98000000     5.0
...         ...     ...
87621         0     NaN
87622         0     NaN
87623         0     NaN
87624         0     NaN
87625         0     NaN

[87626 rows x 2 columns]

In [186]:
tee = pd.read_csv("/Users/kalebmckenzie/Documents/GitHub/4-1-sql/ratings_small.csv")
tee.head(50)

    userId  movieId  rating   timestamp
0        1       31     2.5  1260759144
1        1     1029     3.0  1260759179
2        1     1061     3.0  1260759182
3        1     1129     2.0  1260759185
4        1     1172     4.0  1260759205
5        1     1263     2.0  1260759151
6        1     1287     2.0  1260759187
7        1     1293     2.0  1260759148
8        1     1339     3.5  1260759125
9        1     1343     2.0  1260759131
10       1     1371     2.5  1260759135
11       1     1405     1.0  1260759203
12       1     1953     4.0  1260759191
13       1     2105     4.0  1260759139
14       1     2150     3.0  1260759194
15       1     2193     2.0  1260759198
16       1     2294     2.0  1260759108
17       1     2455     2.5  1260759113
18       1     2968     1.0  1260759200
19       1     3671     3.0  1260759117
20       2       10     4.0   835355493
21       2       17     5.0   835355681
22       2       39     5.0   835355604
23       2       47     4.0   835355552
24       2       50     4.0   835355586
25       2       52     3.0   835356031
26       2       62     3.0   835355749
27       2      110     4.0   835355532
28       2      144     3.0   835356016
29       2      150     5.0   835355395
30       2      153     4.0   835355441
31       2      161     3.0   835355493
32       2      165     3.0   835355441
33       2      168     3.0   835355710
34       2      185     3.0   835355511
35       2      186     3.0   835355664
36       2      208     3.0   835355511
37       2      222     5.0   835355840
38       2      223     1.0   835355749
39       2      225     3.0   835355552
40       2      235     3.0   835355664
41       2      248     3.0   835355896
42       2      253     4.0   835355511
43       2      261     4.0   835355681
44       2      265     5.0   835355697
45       2      266     5.0   835355586
46       2      272     3.0   835355767
47       2      273     4.0   835355779
48       2      292     3.0   835355492
49       2      296     4.0   835355395

# 2. Baseball Database

The [Baseball Database](http://www.seanlahman.com/baseball-archive/statistics/) has an sqlite version. Download it for these exercises.

**2.1** Which player has had the most homeruns?

**2.2** Is there a relation between how many homeruns a player has made in a year and his salary that year? Pull both colums together in a single query

In [98]:
baseball = sqlite3.connect('/Users/kalebmckenzie/Documents/GitHub/4-1-sql/lahmansbaseballdb.sqlite')
b = baseball.cursor()

In [99]:
#Just so I can view the tables in the db

def tables_in_sqlite_dbb(baseball):
    cursor = baseball.execute("SELECT name FROM sqlite_master WHERE type='table';")
    tablesb = [
        v[0] for v in cursor.fetchall()
        if v[0] != "sqlite_sequence"
    ]
    cursor.close()
    return tablesb

In [100]:
baseb_tables = tables_in_sqlite_dbb(baseball)
baseb_tables

['allstarfull',
 'appearances',
 'awardsmanagers',
 'awardsplayers',
 'awardssharemanagers',
 'awardsshareplayers',
 'batting',
 'battingpost',
 'collegeplaying',
 'divisions',
 'fielding',
 'fieldingof',
 'fieldingofsplit',
 'fieldingpost',
 'halloffame',
 'homegames',
 'leagues',
 'managers',
 'managershalf',
 'parks',
 'people',
 'pitching',
 'pitchingpost',
 'salaries',
 'schools',
 'seriespost',
 'teams',
 'teamsfranchises',
 'teamshalf']

# 2.1

In [101]:
b1 = pd.read_sql_query(
"""
SELECT  
    playerID, 
    HR

FROM batting

ORDER BY HR DESC
""", 
    con=baseball
)
b1

#Player Bondsba01 had the most homeruns

         playerID  HR
0       bondsba01  73
1       mcgwima01  70
2        sosasa01  66
3       mcgwima01  65
4        sosasa01  64
...           ...  ..
107424  zavalse01   0
107425  zeuchtj01   0
107426  zimmebr01   0
107427  zimmejo02   0
107428  zimmeky01   0

[107429 rows x 2 columns]

# 2.2

In [196]:
b2 = pd.read_sql_query(
"""
SELECT 
    HR,
    salary

FROM batting

INNER JOIN salaries ON
    batting.yearID = salaries.yearID

ORDER BY HR DESC

""", con=baseball)

b2

          HR      salary
0         73   4500000.0
1         73    270000.0
2         73    320000.0
3         73    200000.0
4         73   3450000.0
...       ..         ...
33740326   0  10400000.0
33740327   0    524000.0
33740328   0    524900.0
33740329   0  21733615.0
33740330   0  14000000.0

[33740331 rows x 2 columns]